# Task1.Seminar3. Задайте список из нескольких чисел. Напишите программу, 
# которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# def func():
#     arr = [6, 2, 4, 3, 5, 7, 3, 9]

#     marker = 0
#     result = 0
#     for i in arr:
#         if marker % 2 != 0:
#             result += i
#         marker += 1

#     print(result)

# func()

# # ____________________________________________________________________________________

def func(f, arr):
    return [arr[x] for x in range(len(arr)) if f(x)]

arr = [6, 2, 4, 3, 5, 7, 3, 9]
print(func(lambda e: e % 2, arr))

# result [2, 3, 7, 9]